luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPort_bf.h
/** \brief  Mask for Ifx_P_LPCR2_Bits.TX_PWDPD */
#define IFX_P_LPCR2_TX_PWDPD_MSK (0x1u)

/** \brief  Offset for Ifx_P_LPCR2_Bits.TX_PWDPD */
#define IFX_P_LPCR2_TX_PWDPD_OFF (15u)

/** \brief  Length for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_OFF (16u)

/** \brief  Length for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_OFF (17u)

/** \brief  Length for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_OFF (18u)

/** \brief  Length for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_OFF (19u)

/** \brief  Length for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_OFF (28u)

/** \brief  Length for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_OFF (29u)

/** \brief  Length for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_OFF (30u)

/** \brief  Length for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_OFF (31u)

/** \brief  Length for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_OFF (20u)

/** \brief  Length for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_OFF (21u)

/** \brief  Length for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_OFF (22u)

/** \brief  Length for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_OFF (23u)

/** \brief  Length for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_OFF (26u)

/** \brief  Length for Ifx_P_OMCR8_Bits.PCL11 */
#define IFX_P_OMCR8_PCL11_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR8_Bits.PCL11 */
#define IFX_P_OMCR8_PCL11_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR8_Bits.PCL11 */
#define IFX_P_OMCR8_PCL11_OFF (27u)

/** \brief  Length for Ifx_P_OMCR8_Bits.PCL8 */
#define IFX_P_OMCR8_PCL8_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR8_Bits.PCL8 */
#define IFX_P_OMCR8_PCL8_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR8_Bits.PCL8 */
#define IFX_P_OMCR8_PCL8_OFF (24u)

/** \brief  Length for Ifx_P_OMCR8_Bits.PCL9 */
#define IFX_P_OMCR8_PCL9_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR8_Bits.PCL9 */
#define IFX_P_OMCR8_PCL9_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR8_Bits.PCL9 */
#define IFX_P_OMCR8_PCL9_OFF (25u)

/** \brief  Length for Ifx_P_OMCR_Bits.PCL0 */
#define IFX_P_OMCR_PCL0_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR_Bits.PCL0 */
#define IFX_P_OMCR_PCL0_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR_Bits.PCL0 */
#define IFX_P_OMCR_PCL0_OFF (16u)

/** \brief  Length for Ifx_P_OMCR_Bits.PCL10 */
#define IFX_P_OMCR_PCL10_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR_Bits.PCL10 */
#define IFX_P_OMCR_PCL10_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR_Bits.PCL10 */
#define IFX_P_OMCR_PCL10_OFF (26u)

/** \brief  Length for Ifx_P_OMCR_Bits.PCL11 */
#define IFX_P_OMCR_PCL11_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR_Bits.PCL11 */
#define IFX_P_OMCR_PCL11_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR_Bits.PCL11 */
#define IFX_P_OMCR_PCL11_OFF (27u)

/** \brief  Length for Ifx_P_OMCR_Bits.PCL12 */
#define IFX_P_OMCR_PCL12_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR_Bits.PCL12 */
#define IFX_P_OMCR_PCL12_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR_Bits.PCL12 */
#define IFX_P_OMCR_PCL12_OFF (28u)

/** \brief  Length for Ifx_P_OMCR_Bits.PCL13 */
#define IFX_P_OMCR_PCL13_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR_Bits.PCL13 */
#define IFX_P_OMCR_PCL13_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR_Bits.PCL13 */
#define IFX_P_OMCR_PCL13_OFF (29u)

/** \brief  Length for Ifx_P_OMCR_Bits.PCL14 */
#define IFX_P_OMCR_PCL14_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR_Bits.PCL14 */
#define IFX_P_OMCR_PCL14_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR_Bits.PCL14 */
#define IFX_P_OMCR_PCL14_OFF (30u)

/** \brief  Length for Ifx_P_OMCR_Bits.PCL15 */
#define IFX_P_OMCR_PCL15_LEN (1u)

/** \brief  Mask for Ifx_P_OMCR_Bits.PCL15 */
#define IFX_P_OMCR_PCL15_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMCR_Bits.PCL15 */
#define IFX_P_OMCR_PCL15_OFF (31u)

/** \brief  Length for Ifx_P_OMCR_Bits.PCL1 */
#define IFX_P_OMCR_PCL1_LEN (1u)

